Stebym/stm32-course-jiroserob/practica3/Src/main.c
    HAL_UART_Transmit(&huart2, (uint8_t*)msg_bienvenida, strlen(msg_bienvenida), HAL_MAX_DELAY);
}

// -----------------------------------------------------------------------
// LLAMADO DE HARDWARE CENTRAL
// -----------------------------------------------------------------------
void Inicializar_Hardware(void)
{
    GPIO_Init_Manual();
    MCO1_Config_Bono();
    TIM2_Encoder_Init();
    TIM3_PWM_Init();
    TIM4_Trigger_Init();
    TIM10_Blinky_Init();
    ADC1_Init_Manual();
    UART2_Init_Manual(); // inicialisador uart asincrono enlazado
}

// -----------------------------------------------------------------------
// CALLBACKS DE INTERRUPCIONES DE LA HAL
// -----------------------------------------------------------------------
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM10) {
        HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1); // prende led espejo de la board auxiliar
    }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2) {
        serial_nuevo = 1;
        HAL_UART_Receive_IT(&huart2, rx_data, 1);
    }
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    if (hadc->Instance == ADC1) {
        valor_adc = HAL_ADC_GetValue(&hadc1);

        // escala de 12 bits 4095 a rango pwm de 1000 pasos
        // zona muerta de 100 para eliminar ruido de piso
        if (valor_adc < 100U) {
            pwm_azul = 0U;
        } else {
            pwm_azul = (valor_adc * 999UL) / 4095UL;
        }

        // re-armamos para la siguiente disparo del tim4
        HAL_ADC_Start_IT(&hadc1);
    }
}
